{smcl}
{com}{sf}{ul off}{txt}
{com}. do test
{txt}
{com}. about

{txt}Stata/MP 16.0 for Windows (64-bit x86-64)
Revision 23 Aug 2019
Copyright 1985-2019 StataCorp LLC

Total physical memory:     {res}  64.00 GB
{txt}Available physical memory: {res}  59.30 GB

Single-user 4-core Stata perpetual license:
       Serial number:  501606271320
         Licensed to:  Álvaro A. Gutiérrez Vargas
                       Research Centre for Operations Research and Statistics
{txt}
{com}. 
. 
. do thirdtest
{txt}
{com}. cscript "stub of test script"
{txt}{hline 54}BEGIN stub of test script

{com}. display "to be filled in"
{res}to be filled in
{txt}
{com}. 
. 
. clear all
{res}{txt}
{com}. set more off
{txt}
{com}. which randregret
{txt}d:\users\u0133260\ado\plus\r\randregret.ado
{res}*! version 1.0.0  11Sep2020
*! [aut & dev]  Álvaro A. Gutiérrez Vargas
*! [aut]                Michel Meulders
*! [aut]                Martina Vandebroek 
{txt}
{com}. which randregret_pure
{txt}d:\users\u0133260\ado\plus\r\randregret_pure.ado
{res}*! version 1.0.0  11Sep2020
*! [aut & dev]  Álvaro A. Gutiérrez Vargas
*! [aut]                Michel Meulders
*! [aut]                Martina Vandebroek 
{txt}
{com}. which randregretpred
{txt}d:\users\u0133260\ado\plus\r\randregretpred.ado
{res}*! version 1.0.0  11Sep2020
*! [aut & dev]  Álvaro A. Gutiérrez Vargas
*! [aut]                Michel Meulders
*! [aut]                Martina Vandebroek 
{txt}
{com}. 
. 
. ssc install estout
{txt}checking {hilite:estout} consistency and verifying not already installed...
all files already exist and are up to date.

{com}. * Simulated data to test robust/cluster error correction 
. 
. * Checking the variance equivalence of:
. *       (*)     non-robust
. *       (*) robust
. *       (*) robust cluster
. *                                               ...     on a homoscedastic (large) data.
. 
. 
. *RRM Models:
. 
. * classic       = 2 attributes -> b = (1,-2)
. 
. * gene          = 2 attributes -> b = (1,-2) & gamma = 0.5 
. 
. * mu            = 2 attributes -> b = (1,-2) & mu        = .75  
. 
. * pure          = 2 (pure)attributes -> b = (1,-2)  
. 
. global n_obs = 550000
{txt}
{com}. global tol = 1e-4
{txt}
{com}. 
. 
. mata:
{txt}{hline 49} mata (type {cmd:end} to exit) {hline}
{com}: void data_gen() 
> {c -(}
>                 st_view(X = ., ., "x*")
>                 st_view(panvar = ., ., "id") 
>                 betas  = st_matrix("betas_st")
>                 gamma  = strtoreal(st_global("real_gamma")) 
>                 mu         = strtoreal(st_global("real_mu")) 
>                         
>                 pure_model       = st_global("pure_model") 
>                         
>                 paninfo = panelsetup(panvar, 1)     
>         npanels = panelstats(paninfo)[1] 
>                 
>                 for(n=1; n <= npanels; ++n) {c -(} 
>             x_n = panelsubmatrix(X, n, paninfo) 
>                         if (pure_model =="YES") {c -(}
>                                 regret_n = -1*betas:* x_n 
>                         {c )-}
>                         else{c -(}
>                                 regret_n =RRM_log_sim_data(x_n, betas, mu, gamma)  
>                         {c )-} 
>                         regret_sum =rowsum(regret_n) 
>                         R_exp = exp(-regret_sum)
>                         p_i =   R_exp :/ colsum(R_exp)
>                                 
>                         cum_p_i =runningsum(p_i)        
>                         rand_draws = J(rows(x_n),1,uniform(1,1)) 
>                         pbb_balance = rand_draws:<cum_p_i
>                         cum_pbb_balance = runningsum(pbb_balance)
>                         choice_n = (cum_pbb_balance:== J(rows(x_n),1,1))
> 
>                 if (n==1)     Y =choice_n       
>                 else Y=Y \ choice_n     
>                 {c )-}
> resindex = st_addvar("byte","choice")
> st_store((1,rows(Y)),resindex,Y)                
> {c )-}

: end
{txt}{hline}

{com}. 
. mata:
{txt}{hline 49} mata (type {cmd:end} to exit) {hline}
{com}: function RRM_log_sim_data(      real matrix x_n, 
>                                                         real rowvector betas,
>                                                         real scalar mu,
>                                                         real scalar gamma)
> {c -(}
> real scalar i, j ,r_m
> real matrix regret_n 
> regret_n = J(rows(x_n), cols(x_n), 0)
> for(i=1; i <= rows(x_n); ++i) {c -(} 
>         for(j=1; j <= rows(x_n); ++j) {c -(} 
>                 if (i!=j) {c -(} 
>                         r_i = ln(gamma :+ exp( (betas :/ mu) :* ( x_n[j , . ] :-  x_n[i, . ])))                                 
>                         regret_n[i, . ] = regret_n[i, . ] :+ mu*r_i             
>                         {c )-} 
>                 {c )-}         
>         {c )-}
> return(regret_n)
> {c )-}
{txt}note: variable r_m unused

{com}: end
{txt}{hline}

{com}. 
. 
. 
. 
. 
. //------------------------------//
. //-----Simulate classic RRM-----//
. //------------------------------//
. version 12
{txt}
{com}. drop _all
{txt}
{com}. set seed 157
{txt}
{com}. set obs ${c -(}n_obs{c )-}
{txt}{p}
number of observations (_N)  was 0,
now 550,000
{p_end}

{com}. gen cluster_id = _n
{txt}
{com}. local n_cluster=3
{txt}
{com}. expand `n_cluster'
{txt}(1,100,000 observations created)

{com}. sort cluster_id
{txt}
{com}. gen id = _n
{txt}
{com}. local n_choices =3
{txt}
{com}. expand `n_choices'
{txt}(3,300,000 observations created)

{com}. bys id : gen alternative = _n
{txt}
{com}. sort  cluster_id id
{txt}
{com}. 
. gen x1 =  runiform(-2,2)
{txt}
{com}. gen x2 =  runiform(-2,2)
{txt}
{com}. 
. global real_gamma = 1
{txt}
{com}. global real_mu = 1
{txt}
{com}. matrix betas_st = (1,-2)
{txt}
{com}. mata: data_gen()
{res}{txt}
{com}. 
. 
. // Non-robust variance
. eststo  c :randregret choice  x* , altern(alternative)  gr(id)          ///
>                                                 rrm(classic) nocons  from(betas_st) 
{txt}{hline 78}
Fitting Classic RRM Model 
{hline 78}
{res}
{txt}initial:{col 16}log likelihood = {res:-635267.35}
rescale:{col 16}log likelihood = {res:-635267.35}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-635267.35}  
Iteration 1:{space 3}log likelihood = {res:-635266.79}  
Iteration 2:{space 3}log likelihood = {res:-635266.77}  
{res}
{txt}RRM: Classic Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 514433.25
{txt}Log likelihood = {res}-635266.77{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}RRM          {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2}  1.00008{col 26}{space 2} .0015843{col 37}{space 1}  631.24{col 46}{space 3}0.000{col 54}{space 4} .9969745{col 67}{space 3} 1.003185
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-1.997799{col 26}{space 2}  .002938{col 37}{space 1} -679.99{col 46}{space 3}0.000{col 54}{space 4}-2.003557{col 67}{space 3}-1.992041
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. matrix classicRRM_V = e(V)                                              
{txt}
{com}.                                                 
. // Robust variance
. eststo  cR :randregret choice  x* , altern(alternative)  gr(id)         ///
>                                                 rrm(classic) nocons  from(betas_st)                     ///
>                                                 robust
{txt}{hline 78}
Fitting Classic RRM Model 
{hline 78}
{res}
{txt}initial:{col 16}log likelihood = {res:-635267.35}
rescale:{col 16}log likelihood = {res:-635267.35}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-635267.35}  
Iteration 1:{space 3}log likelihood = {res:-635266.79}  
Iteration 2:{space 3}log likelihood = {res:-635266.77}  
{res}
{txt}RRM: Classic Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 512638.71
{txt}Log likelihood = {res}-635266.77{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}RRM          {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2}  1.00008{col 26}{space 2} .0015856{col 37}{space 1}  630.72{col 46}{space 3}0.000{col 54}{space 4} .9969719{col 67}{space 3} 1.003187
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-1.997799{col 26}{space 2} .0029431{col 37}{space 1} -678.82{col 46}{space 3}0.000{col 54}{space 4}-2.003567{col 67}{space 3}-1.992031
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. matrix classicRRM_V_robust = e(V)
{txt}
{com}.                                                 
. // Cluster-robust variance
. eststo cC : randregret choice  x* , altern(alternative)  gr(id)         ///
>                                                 rrm(classic) nocons  from(betas_st)                     ///
>                                                 cluster(cluster_id)
{res}{txt}{hline 78}
Fitting Classic RRM Model 
{hline 78}
{res}
{txt}initial:{col 16}log likelihood = {res:-635267.35}
rescale:{col 16}log likelihood = {res:-635267.35}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-635267.35}  
Iteration 1:{space 3}log likelihood = {res:-635266.79}  
Iteration 2:{space 3}log likelihood = {res:-635266.77}  
{res}
{txt}RRM: Classic Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 513389.28
{txt}Log likelihood = {res}-635266.77{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 34}(Std. Err. adjusted for {res}550000{txt} clusters in cluster_id)
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}RRM          {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2}  1.00008{col 26}{space 2} .0015844{col 37}{space 1}  631.21{col 46}{space 3}0.000{col 54}{space 4} .9969744{col 67}{space 3} 1.003185
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-1.997799{col 26}{space 2} .0029417{col 37}{space 1} -679.13{col 46}{space 3}0.000{col 54}{space 4}-2.003565{col 67}{space 3}-1.992033
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. matrix classicRRM_V_cluster = e(V)
{txt}
{com}.                                                 
. esttab  , label nodepvar nonumber    b(a6) se(a6)
{res}
{txt}{hline 68}
{txt}                                c              cR              cC   
{txt}{hline 68}
{res}RRM                                                                 {txt}
{txt}x1                  {res}     1.000080***     1.000080***     1.000080***{txt}
                    {res} {ralign 12:{txt:(}0.00158432{txt:)}}    {ralign 12:{txt:(}0.00158562{txt:)}}    {ralign 12:{txt:(}0.00158438{txt:)}}   {txt}

{txt}x2                  {res}    -1.997799***    -1.997799***    -1.997799***{txt}
                    {res} {ralign 12:{txt:(}0.00293798{txt:)}}    {ralign 12:{txt:(}0.00294306{txt:)}}    {ralign 12:{txt:(}0.00294172{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}      4950000         4950000         4950000   {txt}
{txt}{hline 68}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. esttab  using "var_correction_classicRRM"  , nostar label nodepvar nonumber  b(a6) se(a6) replace
{res}{txt}(output written to {browse  `"var_correction_classicRRM.txt"'})

{com}. estimates clear                                         
{res}{txt}
{com}. 
. 
. display                          mreldif(classicRRM_V, classicRRM_V_robust)
{res}2.986e-08
{txt}
{com}. rcof "noisily assert mreldif(classicRRM_V, classicRRM_V_robust) < ${c -(}tol{c )-}" == 0
{txt}
{com}. 
. display                          mreldif(classicRRM_V, classicRRM_V_cluster)
{res}2.202e-08
{txt}
{com}. rcof "noisily assert mreldif(classicRRM_V, classicRRM_V_cluster) <${c -(}tol{c )-}" == 0
{txt}
{com}. 
. 
. 
. 
. 
. 
. 
. //------------------------------//
. //---------Simulate GRRM--------//
. //------------------------------//
. version 12
{txt}
{com}. drop _all
{txt}
{com}. set seed 157
{txt}
{com}. set obs ${c -(}n_obs{c )-}
{txt}{p}
number of observations (_N)  was 0,
now 550,000
{p_end}

{com}. gen cluster_id = _n
{txt}
{com}. local n_cluster=3
{txt}
{com}. expand `n_cluster'
{txt}(1,100,000 observations created)

{com}. sort cluster_id
{txt}
{com}. gen id = _n
{txt}
{com}. local n_choices =3
{txt}
{com}. expand `n_choices'
{txt}(3,300,000 observations created)

{com}. bys id : gen alternative = _n
{txt}
{com}. sort  cluster_id id
{txt}
{com}. 
. gen x1 =  runiform(-2,2)
{txt}
{com}. gen x2 =  runiform(-2,2)
{txt}
{com}. 
. global real_gamma = 0.5
{txt}
{com}. global real_mu = 1
{txt}
{com}. matrix betas_st = (1,-2)
{txt}
{com}. mata: data_gen()
{res}{txt}
{com}. 
. 
. matrix init_gene  = betas_st,logit(${c -(}real_gamma{c )-})
{txt}
{com}. 
. // Non-robust variance
. eststo  g :randregret choice  x* , altern(alternative)  gr(id)                  ///
>                                                 rrm(gene) nocons  from(init_gene)  show notlr   ///
> 
{txt}{hline 78}
Fitting Generalized RRM Model 
{hline 78}
{res}
{txt}initial:{col 16}log likelihood = {res:-524922.51}
rescale:{col 16}log likelihood = {res:-524922.51}
rescale eq:{col 16}log likelihood = {res:-524922.51}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-524922.51}  
Iteration 1:{space 3}log likelihood = {res:-524922.51}  (backed up)
Iteration 2:{space 3}log likelihood = {res:-524922.44}  
Iteration 3:{space 3}log likelihood = {res:-524922.44}  
{res}
{txt}GRRM: Generalized Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 113526.21
{txt}Log likelihood = {res}-524922.44{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}RRM          {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2} .9991458{col 26}{space 2} .0029662{col 37}{space 1}  336.84{col 46}{space 3}0.000{col 54}{space 4} .9933321{col 67}{space 3}  1.00496
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} -1.99786{col 26}{space 2} .0063318{col 37}{space 1} -315.53{col 46}{space 3}0.000{col 54}{space 4} -2.01027{col 67}{space 3} -1.98545
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}gamma_star   {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0038689{col 26}{space 2} .0182109{col 37}{space 1}   -0.21{col 46}{space 3}0.832{col 54}{space 4}-.0395616{col 67}{space 3} .0318238
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       gamma {c |}{col 14}{res}{space 2} .4990328{col 26}{space 2} .0045527{col 54}{space 4} .4901109{col 67}{space 3} .5079553
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. matrix GRRM_V = e(V)                                            
{txt}
{com}.                                                                                                 
. // Robust variance
. eststo  gR :randregret choice  x* , altern(alternative)  gr(id)                 ///
>                                                 rrm(gene) nocons  from(init_gene)  show notlr   ///
>                                                 robust
{txt}{hline 78}
Fitting Generalized RRM Model 
{hline 78}
{res}
{txt}initial:{col 16}log likelihood = {res:-524922.51}
rescale:{col 16}log likelihood = {res:-524922.51}
rescale eq:{col 16}log likelihood = {res:-524922.51}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-524922.51}  
Iteration 1:{space 3}log likelihood = {res:-524922.51}  (backed up)
Iteration 2:{space 3}log likelihood = {res:-524922.44}  
Iteration 3:{space 3}log likelihood = {res:-524922.44}  
{res}
{txt}GRRM: Generalized Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 114032.40
{txt}Log likelihood = {res}-524922.44{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}RRM          {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2} .9991458{col 26}{space 2} .0029597{col 37}{space 1}  337.59{col 46}{space 3}0.000{col 54}{space 4} .9933449{col 67}{space 3} 1.004947
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} -1.99786{col 26}{space 2} .0063186{col 37}{space 1} -316.18{col 46}{space 3}0.000{col 54}{space 4}-2.010244{col 67}{space 3}-1.985475
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}gamma_star   {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0038689{col 26}{space 2} .0181395{col 37}{space 1}   -0.21{col 46}{space 3}0.831{col 54}{space 4}-.0394216{col 67}{space 3} .0316838
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       gamma {c |}{col 14}{res}{space 2} .4990328{col 26}{space 2} .0045348{col 54}{space 4} .4901459{col 67}{space 3} .5079203
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. matrix GRRM_V_robust = e(V)                                             
{txt}
{com}.                 
. // Cluster-robust variance
. eststo gC : randregret choice  x* , altern(alternative)  gr(id)                 ///
>                                                 rrm(gene) nocons  from(init_gene)  show notlr   ///
>                                                 cluster(cluster_id)
{res}{txt}{hline 78}
Fitting Generalized RRM Model 
{hline 78}
{res}
{txt}initial:{col 16}log likelihood = {res:-524922.51}
rescale:{col 16}log likelihood = {res:-524922.51}
rescale eq:{col 16}log likelihood = {res:-524922.51}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-524922.51}  
Iteration 1:{space 3}log likelihood = {res:-524922.51}  (backed up)
Iteration 2:{space 3}log likelihood = {res:-524922.44}  
Iteration 3:{space 3}log likelihood = {res:-524922.44}  
{res}
{txt}GRRM: Generalized Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 114364.94
{txt}Log likelihood = {res}-524922.44{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 34}(Std. Err. adjusted for {res}550000{txt} clusters in cluster_id)
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}RRM          {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2} .9991458{col 26}{space 2} .0029553{col 37}{space 1}  338.09{col 46}{space 3}0.000{col 54}{space 4} .9933536{col 67}{space 3} 1.004938
{txt}{space 10}x2 {c |}{col 14}{res}{space 2} -1.99786{col 26}{space 2} .0063146{col 37}{space 1} -316.39{col 46}{space 3}0.000{col 54}{space 4}-2.010236{col 67}{space 3}-1.985483
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}gamma_star   {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.0038689{col 26}{space 2} .0181317{col 37}{space 1}   -0.21{col 46}{space 3}0.831{col 54}{space 4}-.0394064{col 67}{space 3} .0316686
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
       gamma {c |}{col 14}{res}{space 2} .4990328{col 26}{space 2} .0045329{col 54}{space 4} .4901497{col 67}{space 3} .5079165
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. matrix GRRM_V_cluster = e(V)                                            
{txt}
{com}.                 
. esttab  , label nodepvar nonumber    b(a6) se(a6)
{res}
{txt}{hline 68}
{txt}                                g              gR              gC   
{txt}{hline 68}
{res}RRM                                                                 {txt}
{txt}x1                  {res}     0.999146***     0.999146***     0.999146***{txt}
                    {res} {ralign 12:{txt:(}0.00296623{txt:)}}    {ralign 12:{txt:(}0.00295969{txt:)}}    {ralign 12:{txt:(}0.00295528{txt:)}}   {txt}

{txt}x2                  {res}    -1.997860***    -1.997860***    -1.997860***{txt}
                    {res} {ralign 12:{txt:(}0.00633182{txt:)}}    {ralign 12:{txt:(}0.00631864{txt:)}}    {ralign 12:{txt:(}0.00631462{txt:)}}   {txt}
{hline 68}
{res}gamma_star                                                          {txt}
{txt}Constant            {res}  -0.00386892     -0.00386892     -0.00386892   {txt}
                    {res} {ralign 12:{txt:(}0.0182109{txt:)}}    {ralign 12:{txt:(}0.0181395{txt:)}}    {ralign 12:{txt:(}0.0181317{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}      4950000         4950000         4950000   {txt}
{txt}{hline 68}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. esttab  using "var_correction_GRRM"  , nostar label nodepvar nonumber  b(a6) se(a6) replace
{res}{txt}(output written to {browse  `"var_correction_GRRM.txt"'})

{com}. estimates clear                                                         
{res}{txt}
{com}. 
. 
. display                          mreldif(GRRM_V, GRRM_V_robust)
{res}2.596e-06
{txt}
{com}. rcof "noisily assert mreldif(GRRM_V, GRRM_V_robust) < ${c -(}tol{c )-}" == 0
{txt}
{com}. 
. display                          mreldif(GRRM_V, GRRM_V_cluster)
{res}2.877e-06
{txt}
{com}. rcof "noisily assert mreldif(GRRM_V, GRRM_V_cluster) < ${c -(}tol{c )-}" == 0
{txt}
{com}. 
. 
.                                                                                         
. //------------------------------//
. //--------Simulate muRRM--------//
. //------------------------------//
. 
. version 12
{txt}
{com}. drop _all
{txt}
{com}. set seed 157
{txt}
{com}. set obs ${c -(}n_obs{c )-}
{txt}{p}
number of observations (_N)  was 0,
now 550,000
{p_end}

{com}. gen cluster_id = _n
{txt}
{com}. local n_cluster=3
{txt}
{com}. expand `n_cluster'
{txt}(1,100,000 observations created)

{com}. sort cluster_id
{txt}
{com}. gen id = _n
{txt}
{com}. local n_choices =3
{txt}
{com}. expand `n_choices'
{txt}(3,300,000 observations created)

{com}. bys id : gen alternative = _n
{txt}
{com}. sort  cluster_id id
{txt}
{com}. 
. gen x1 =  runiform(-2,2)
{txt}
{com}. gen x2 =  runiform(-2,2)
{txt}
{com}. 
. global real_gamma = 1
{txt}
{com}. global real_mu = 0.75
{txt}
{com}. matrix betas_st = (1,-2)
{txt}
{com}. mata: data_gen()
{res}{txt}
{com}. 
. *invlogit(-1.72)*5 \approx 0.75 in transformed scale
. matrix init_mu = betas_st, -1.72
{txt}
{com}. 
. // Non-robust variance
. eststo  u :randregret choice  x* , altern(alternative)  gr(id)          ///
>                                                 rrm(mu) nocons notlr show  from(init_mu)        ///
> 
{txt}{hline 78}
Fitting muRRM Model
{hline 78}
{res}
{txt}initial:{col 16}log likelihood = {res:-642242.69}
rescale:{col 16}log likelihood = {res:-642242.69}
rescale eq:{col 16}log likelihood = {res:-642242.69}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-642242.69}  
Iteration 1:{space 3}log likelihood = {res:-642240.92}  
Iteration 2:{space 3}log likelihood = {res:-642239.83}  
Iteration 3:{space 3}log likelihood = {res:-642239.83}  
{res}
{txt}muRRM: Mu-Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 522035.61
{txt}Log likelihood = {res}-642239.83{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}RRM          {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2} .9999218{col 26}{space 2}  .001596{col 37}{space 1}  626.53{col 46}{space 3}0.000{col 54}{space 4} .9967938{col 67}{space 3}  1.00305
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-1.996829{col 26}{space 2} .0029447{col 37}{space 1} -678.12{col 46}{space 3}0.000{col 54}{space 4}  -2.0026{col 67}{space 3}-1.991057
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}mu_star      {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.734928{col 26}{space 2} .0106916{col 37}{space 1} -162.27{col 46}{space 3}0.000{col 54}{space 4}-1.755883{col 67}{space 3}-1.713973
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          mu {c |}{col 14}{res}{space 2} .7497915{col 26}{space 2} .0068143{col 54}{space 4} .7365334{col 67}{space 3} .7632455
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}.                                                 
. matrix muRRM_V = e(V)                                           
{txt}
{com}. // Robust variance
. eststo  uR :randregret choice  x* , altern(alternative)  gr(id)                 ///
>                                                 rrm(mu) nocons notlr show  from(init_mu)                ///
>                                                 robust
{txt}{hline 78}
Fitting muRRM Model
{hline 78}
{res}
{txt}initial:{col 16}log likelihood = {res:-642242.69}
rescale:{col 16}log likelihood = {res:-642242.69}
rescale eq:{col 16}log likelihood = {res:-642242.69}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-642242.69}  
Iteration 1:{space 3}log likelihood = {res:-642240.92}  
Iteration 2:{space 3}log likelihood = {res:-642239.83}  
Iteration 3:{space 3}log likelihood = {res:-642239.83}  
{res}
{txt}muRRM: Mu-Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 520863.89
{txt}Log likelihood = {res}-642239.83{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}RRM          {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2} .9999218{col 26}{space 2}  .001596{col 37}{space 1}  626.52{col 46}{space 3}0.000{col 54}{space 4} .9967937{col 67}{space 3}  1.00305
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-1.996829{col 26}{space 2} .0029489{col 37}{space 1} -677.14{col 46}{space 3}0.000{col 54}{space 4}-2.002609{col 67}{space 3}-1.991049
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}mu_star      {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.734928{col 26}{space 2}  .010691{col 37}{space 1} -162.28{col 46}{space 3}0.000{col 54}{space 4}-1.755882{col 67}{space 3}-1.713974
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          mu {c |}{col 14}{res}{space 2} .7497915{col 26}{space 2} .0068139{col 54}{space 4} .7365341{col 67}{space 3} .7632447
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. matrix muRRM_V_robust= e(V)                                             
{txt}
{com}.                                                 
. // Cluster-robust variance
. eststo uC : randregret choice  x* , altern(alternative)  gr(id)                 ///
>                                                 rrm(mu) nocons notlr show  from(init_mu)                ///
>                                                 cluster(cluster_id)
{res}{txt}{hline 78}
Fitting muRRM Model
{hline 78}
{res}
{txt}initial:{col 16}log likelihood = {res:-642242.69}
rescale:{col 16}log likelihood = {res:-642242.69}
rescale eq:{col 16}log likelihood = {res:-642242.69}
{res}{txt}Iteration 0:{space 3}log likelihood = {res:-642242.69}  
Iteration 1:{space 3}log likelihood = {res:-642240.92}  
Iteration 2:{space 3}log likelihood = {res:-642239.83}  
Iteration 3:{space 3}log likelihood = {res:-642239.83}  
{res}
{txt}muRRM: Mu-Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 520922.88
{txt}Log likelihood = {res}-642239.83{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 34}(Std. Err. adjusted for {res}550000{txt} clusters in cluster_id)
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}RRM          {txt}{c |}
{space 10}x1 {c |}{col 14}{res}{space 2} .9999218{col 26}{space 2} .0015964{col 37}{space 1}  626.34{col 46}{space 3}0.000{col 54}{space 4} .9967928{col 67}{space 3} 1.003051
{txt}{space 10}x2 {c |}{col 14}{res}{space 2}-1.996829{col 26}{space 2} .0029499{col 37}{space 1} -676.91{col 46}{space 3}0.000{col 54}{space 4}-2.002611{col 67}{space 3}-1.991047
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}mu_star      {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.734928{col 26}{space 2}  .010686{col 37}{space 1} -162.36{col 46}{space 3}0.000{col 54}{space 4}-1.755872{col 67}{space 3}-1.713984
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
          mu {c |}{col 14}{res}{space 2} .7497915{col 26}{space 2} .0068108{col 54}{space 4} .7365402{col 67}{space 3} .7632384
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. matrix muRRM_V_cluster = e(V)                                           
{txt}
{com}.                 
.                 
. esttab  , label nodepvar nonumber    b(a6) se(a6)
{res}
{txt}{hline 68}
{txt}                                u              uR              uC   
{txt}{hline 68}
{res}RRM                                                                 {txt}
{txt}x1                  {res}     0.999922***     0.999922***     0.999922***{txt}
                    {res} {ralign 12:{txt:(}0.00159597{txt:)}}    {ralign 12:{txt:(}0.00159600{txt:)}}    {ralign 12:{txt:(}0.00159645{txt:)}}   {txt}

{txt}x2                  {res}    -1.996829***    -1.996829***    -1.996829***{txt}
                    {res} {ralign 12:{txt:(}0.00294465{txt:)}}    {ralign 12:{txt:(}0.00294893{txt:)}}    {ralign 12:{txt:(}0.00294993{txt:)}}   {txt}
{hline 68}
{res}mu_star                                                             {txt}
{txt}Constant            {res}    -1.734928***    -1.734928***    -1.734928***{txt}
                    {res} {ralign 12:{txt:(}0.0106916{txt:)}}    {ralign 12:{txt:(}0.0106910{txt:)}}    {ralign 12:{txt:(}0.0106860{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}      4950000         4950000         4950000   {txt}
{txt}{hline 68}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. esttab  using "var_correction_muRRM"  , nostar label nodepvar nonumber  b(a6) se(a6) replace
{res}{txt}(output written to {browse  `"var_correction_muRRM.txt"'})

{com}. estimates clear         
{res}{txt}
{com}. 
. 
. display                          mreldif(muRRM_V, muRRM_V_robust)
{res}2.520e-08
{txt}
{com}. rcof "noisily assert mreldif(muRRM_V, muRRM_V_robust) < ${c -(}tol{c )-}" == 0
{txt}
{com}. 
. display                          mreldif(muRRM_V, muRRM_V_cluster)
{res}1.193e-07
{txt}
{com}. rcof "noisily assert mreldif(muRRM_V, muRRM_V_cluster) < ${c -(}tol{c )-}" == 0
{txt}
{com}. 
. 
. //------------------------------//
. //--------Simulate PRRM --------//
. //------------------------------//
. 
. version 12
{txt}
{com}. 
. drop _all
{txt}
{com}. set seed 157
{txt}
{com}. set obs ${c -(}n_obs{c )-}
{txt}{p}
number of observations (_N)  was 0,
now 550,000
{p_end}

{com}. gen cluster_id = _n
{txt}
{com}. local n_cluster=3
{txt}
{com}. expand `n_cluster'
{txt}(1,100,000 observations created)

{com}. sort cluster_id
{txt}
{com}. gen id = _n
{txt}
{com}. local n_choices =3
{txt}
{com}. expand `n_choices'
{txt}(3,300,000 observations created)

{com}. bys id : gen alternative = _n
{txt}
{com}. sort  cluster_id id
{txt}
{com}. 
. gen _x1 =  runiform(-2,2)
{txt}
{com}. gen _x2 =  runiform(-2,2)
{txt}
{com}. 
. *Transformation using randregre_pure
. randregret_pure _x1 , gr(id) sign(pos) prefix(x_)
{res}{txt}
{com}. randregret_pure _x2 , gr(id) sign(neg) prefix(x_)       
{res}{txt}
{com}. 
. global pure_model = "YES"
{txt}
{com}. 
. global real_gamma       = 1
{txt}
{com}. global real_mu          = 1
{txt}
{com}. matrix betas_st         = (1,-2)
{txt}
{com}. mata: data_gen()
{res}{txt}
{com}. 
. 
. // Non-robust variance
. eststo p : randregret choice , altern(alternative)  gr(id)              ///
>                                                 rrm(pure) nocons  tech(bfgs)                    ///
>                                                 pos(_x1) neg(_x2)                                               
{res}
{txt}PRRM: Pure Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 553174.35
{txt}Log likelihood = {res}-655381.15{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}choice       {txt}{c |}
{space 9}_x1 {c |}{col 14}{res}{space 2} 1.000236{col 26}{space 2} .0015951{col 37}{space 1}  627.05{col 46}{space 3}0.000{col 54}{space 4} .9971091{col 67}{space 3} 1.003362
{txt}{space 9}_x2 {c |}{col 14}{res}{space 2} -1.99714{col 26}{space 2} .0027909{col 37}{space 1} -715.59{col 46}{space 3}0.000{col 54}{space 4} -2.00261{col 67}{space 3} -1.99167
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
The Pure-RRM uses a transformation of the original regressors using options
positive() and negative() as detailed in {browse "https://www.sciencedirect.com/science/article/pii/S0965856415000166":S. van Cranenburgh et. al (2015)}
Afterward, randregret invokes clogit using these transormed regresors
{hline 78}

{com}. 
. matrix PRRM_V = e(V)                                            
{txt}
{com}.                                                 
. // Robust variance
. eststo pR : randregret choice , altern(alternative)  gr(id)     ///
>                                                 rrm(pure) nocons  tech(bfgs)                    ///
>                                                 pos(_x1) neg(_x2)                                               ///
>                                                 robust
{res}
{txt}PRRM: Pure Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 552592.68
{txt}Log likelihood = {res}-655381.15{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}choice       {txt}{c |}
{space 9}_x1 {c |}{col 14}{res}{space 2} 1.000236{col 26}{space 2} .0015953{col 37}{space 1}  626.98{col 46}{space 3}0.000{col 54}{space 4} .9971088{col 67}{space 3} 1.003362
{txt}{space 9}_x2 {c |}{col 14}{res}{space 2} -1.99714{col 26}{space 2}  .002793{col 37}{space 1} -715.06{col 46}{space 3}0.000{col 54}{space 4}-2.002614{col 67}{space 3}-1.991666
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
The Pure-RRM uses a transformation of the original regressors using options
positive() and negative() as detailed in {browse "https://www.sciencedirect.com/science/article/pii/S0965856415000166":S. van Cranenburgh et. al (2015)}
Afterward, randregret invokes clogit using these transormed regresors
{hline 78}

{com}. matrix PRRM_V_robust = e(V)                                             
{txt}
{com}. // Cluster-robust variance
. eststo pC : randregret choice , altern(alternative)  gr(id)     ///
>                                                 rrm(pure) nocons  tech(bfgs)                    ///
>                                                 pos(_x1) neg(_x2)                                               ///
>                                                 cluster(cluster_id)
{res}
{txt}PRRM: Pure Random Regret Minimization Model

Case ID variable: id{col 48}Number of cases{col 67}= {res}   1650000
{txt}Alternative variable: alternative{col 48}Number of obs{col 67}= {res}   4950000
{txt}{col 48}Wald chi2(2){col 67}= {res} 552505.49
{txt}Log likelihood = {res}-655381.15{col 48}{txt}{col 48}Prob > chi2{col 67}= {res}    0.0000
{txt}{ralign 78:(Std. Err. adjusted for {res:550,000} clusters in cluster_id)}
{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      choice{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}choice       {txt}{c |}
{space 9}_x1 {c |}{col 14}{res}{space 2} 1.000236{col 26}{space 2} .0015961{col 37}{space 1}  626.66{col 46}{space 3}0.000{col 54}{space 4} .9971072{col 67}{space 3} 1.003364
{txt}{space 9}_x2 {c |}{col 14}{res}{space 2} -1.99714{col 26}{space 2} .0027928{col 37}{space 1} -715.10{col 46}{space 3}0.000{col 54}{space 4}-2.002614{col 67}{space 3}-1.991666
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
The Pure-RRM uses a transformation of the original regressors using options
positive() and negative() as detailed in {browse "https://www.sciencedirect.com/science/article/pii/S0965856415000166":S. van Cranenburgh et. al (2015)}
Afterward, randregret invokes clogit using these transormed regresors
{hline 78}

{com}. 
. matrix PRRM_V_cluster = e(V)                                            
{txt}
{com}.                                                                 
. esttab  , label nodepvar nonumber    b(a6) se(a6)                                                       
{res}
{txt}{hline 68}
{txt}                                p              pR              pC   
{txt}{hline 68}
{res}choice                                                              {txt}
{txt}_x1                 {res}     1.000236***     1.000236***     1.000236***{txt}
                    {res} {ralign 12:{txt:(}0.00159515{txt:)}}    {ralign 12:{txt:(}0.00159533{txt:)}}    {ralign 12:{txt:(}0.00159614{txt:)}}   {txt}

{txt}_x2                 {res}    -1.997140***    -1.997140***    -1.997140***{txt}
                    {res} {ralign 12:{txt:(}0.00279092{txt:)}}    {ralign 12:{txt:(}0.00279295{txt:)}}    {ralign 12:{txt:(}0.00279282{txt:)}}   {txt}
{txt}{hline 68}
{txt}Observations        {res}      4950000         4950000         4950000   {txt}
{txt}{hline 68}
{txt}Standard errors in parentheses
{txt}* p<0.05, ** p<0.01, *** p<0.001

{com}. esttab  using "var_correction_PRRM"  , nostar label nodepvar nonumber  b(a6) se(a6) replace
{res}{txt}(output written to {browse  `"var_correction_PRRM.txt"'})

{com}. estimates clear         
{res}{txt}
{com}. 
. display                          mreldif(PRRM_V, PRRM_V_robust)
{res}1.135e-08
{txt}
{com}. rcof "noisily assert mreldif(PRRM_V, PRRM_V_robust) < ${c -(}tol{c )-}" == 0
{txt}
{com}. 
. display                          mreldif(PRRM_V, PRRM_V_cluster)
{res}1.061e-08
{txt}
{com}. rcof "noisily assert mreldif(PRRM_V, PRRM_V_cluster) < ${c -(}tol{c )-}" == 0
{txt}
{com}. 
. 
{txt}end of do-file

{com}. 
{txt}end of do-file

{com}. quietly log close
{smcl}
{com}{sf}{ul off}